## Joining Tables â€“ Inner

Let us understand how to join data from multiple tables.
* We will primarily focus on ANSI style join (`JOIN` with `ON`).

* There are different types of joins :
  * `INNER JOIN` - Get all the records from both the datasets which satisfies JOIN condition.
  * `OUTER JOIN` - We will get into the details as part of the next topic

* Example for INNER JOIN

```sql
SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
LIMIT 
    10
```

* We can join more than 2 tables in one query. Here is how it will look like.

```sql
SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
    JOIN 
    products p
        ON p.product_id = oi.order_item_product_id
LIMIT 
    10
```

* If we have to apply additional filters, it is recommended to use `WHERE` clause. `ON` clause should only have join conditions.

* We can have non equal join conditions as well, but they are not used that often.

* Here are some of the examples for INNER JOIN:
  * Get order id, date, status and item revenue for all order items.
  * Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED.
  * Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED for the orders that are placed in the month of 2014 January.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

* Compute Inner Join on Orders and Order Items based on Key Columns

In [3]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
LIMIT 
    10

10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95)]

In [4]:
%sql SELECT COUNT(1) FROM orders

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(68883,)]

In [5]:
%sql SELECT COUNT(1) FROM order_items

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(172198,)]

* Total number of rows after inner join will be same as rows in child table if it is not containing any null values on the key columns of join

In [6]:
%%sql

SELECT 
    COUNT(1)
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(172198,)]

* Inner join with filter

In [7]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
LIMIT
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 99.96),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 129.99)]

In [8]:
%%sql

SELECT 
    COUNT(1)
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(75408,)]

In [9]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND 
    to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.97),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 100.0),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 79.98),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 399.98),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.98),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 99.96),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 19.99),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 150.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 50.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 119.97)]

In [10]:
%%sql

SELECT 
    COUNT(1)
FROM 
    orders o 
    JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_status IN ('COMPLETE', 'CLOSED')
    AND 
    to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(6198,)]